Revit 2024 API
IndexBuffer Class
 A buffer that stores vertex indices for rendering.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class IndexBuffer : IDisposable
Visual Basic
Public Class IndexBuffer _
	Implements IDisposable
Visual C++
public ref class IndexBuffer : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.IndexBuffer
See Also
IndexBuffer Members
Autodesk.Revit.DB.DirectContext3D Namespace